istepura/kw41z-rf-driver/source/NanostackRfPhyKw41z.cpp
/*
   Copyright 2017, Igor Stepura <igor.stepura@gmail.com>

   Inspired by mcr20a-rf-driver by Andrei Kovacs <Andrei.Kovacs@freescale.com>
   and NXP KW41Z 802.15.4 PHY implementation

   Licensed under the Apache License, Version 2.0 (the "License");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

       http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an "AS IS" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
*/

#include "NanostackRfPhyKw41z.h"
#include "ns_types.h"
#include "platform/arm_hal_interrupt.h"
#include "nanostack/platform/arm_hal_phy.h"
#include <string.h>
#include "rtos.h"
#include "fsl_xcvr.h"
#include "PhyTypes.h"

/* PHY states */
typedef enum {
  gIdle_c,
  gRX_c,
  gTX_c,
  gCCA_c,
  gTR_c,
  gCCCA_c,
}phySeqState_t;

typedef enum{
    gPhyPwrRun_c,
    gPhyPwrDSM_c,
}phyPwrMode_t;

/* PHY channel state */
enum {
  gChannelIdle_c,
  gChannelBusy_c
};

enum {
  gMacRole_DeviceOrCoord_c,
  gMacRole_PanCoord_c
};

/* Cca types */
enum {
  gCcaED_c,            /* energy detect - CCA bit not active, not to be used for T and CCCA sequences */
  gCcaCCA_MODE1_c,     /* energy detect - CCA bit ACTIVE */
  gCcaCCA_MODE2_c,     /* 802.15.4 compliant signal detect - CCA bit ACTIVE */
  gCcaCCA_MODE3_c,     /* 802.15.4 compliant signal detect and energy detect - CCA bit ACTIVE */
  gInvalidCcaType_c    /* illegal type */
};

static phyPwrMode_t mPhyPwrState = gPhyPwrRun_c;
#ifndef MBED_CONF_KW41Z_RF_LONG_MAC_ADDRESS
#define MBED_CONF_KW41Z_RF_LONG_MAC_ADDRESS  {1, 2, 3, 4, 5, 6, 7, 8}
#endif

#ifndef MBED_CONF_MBED_MESH_API_6LOWPAN_ND_CHANNEL
#define MBED_CONF_MBED_MESH_API_6LOWPAN_ND_CHANNEL (12)
#endif

static uint8_t MAC_address[8] = MBED_CONF_KW41Z_RF_LONG_MAC_ADDRESS;
static NanostackRfPhyKw41z *rf = NULL;

#ifdef MBED_CONF_RTOS_PRESENT
static Thread irq_thread(osPriorityRealtime, 1024);
#endif

static phy_device_driver_s device_driver;
static int8_t  rf_radio_driver_id = -1;
static uint8_t  mac_tx_handle = 0;

static uint8_t rf_phy_channel = 0;
static uint8_t  need_ack = 0;

#define RF_BUFFER_SIZE 128
/*RF receive buffer*/
static uint8_t rf_buffer[RF_BUFFER_SIZE];

/* Channel configurations for 2.4 */
static const phy_rf_channel_configuration_s phy_24ghz = {2405000000U, 5000000U, 250000U, 16U, M_OQPSK};

static const phy_device_channel_page_s phy_channel_pages[] = {
        { CHANNEL_PAGE_0, &phy_24ghz},
        { CHANNEL_PAGE_0, NULL}
};
/* Set the default power level to 0dBm */
#ifndef gPhyDefaultTxPowerLevel_d
#define gPhyDefaultTxPowerLevel_d     (22)
#endif
#define CORE_CLOCK_FREQ 47972352U
#define gPhyMaxTxPowerLevel_d         (32)
uint8_t gPhyChannelTxPowerLimits[] = { gPhyMaxTxPowerLevel_d,   /* 11 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 12 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 13 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 14 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 15 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 16 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 17 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 18 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 19 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 20 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 21 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 22 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 23 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 24 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 25 */ \
                                 gPhyMaxTxPowerLevel_d };  /* 26 */



MBED_UNUSED static void rf_init(void);
MBED_UNUSED static int8_t rf_device_register(void);
MBED_UNUSED static void rf_device_unregister(void);
MBED_UNUSED static int8_t  rf_interface_state_control(phy_interface_state_e new_state, uint8_t rf_channel);
MBED_UNUSED static int8_t  rf_extension(phy_extension_type_e extension_type,uint8_t *data_ptr);
MBED_UNUSED static int8_t  rf_address_write(phy_address_type_e address_type,uint8_t *address_ptr);
MBED_UNUSED static int8_t rf_start_cca(uint8_t *data_ptr, uint16_t data_length, uint8_t tx_handle, data_protocol_e data_protocol );
MBED_UNUSED static void    rf_abort(void);
MBED_UNUSED static void    rf_promiscuous(uint8_t mode);
MBED_UNUSED static void rf_receive(void);
MBED_UNUSED static void rf_mac64_read(uint8_t *address);
MBED_UNUSED static void    rf_set_power_state(phyPwrMode_t newState);
MBED_UNUSED static void rf_handle_tx_end(uint8_t);
static void rf_set_address(uint8_t *address);

static inline phySeqState_t rf_get_state(void)
{
    return (phySeqState_t)(((ZLL->PHY_CTRL & ZLL_PHY_CTRL_XCVSEQ_MASK) >> ZLL_PHY_CTRL_XCVSEQ_SHIFT));
} 


static void PHY_InterruptHandler(void);
static void PHY_InterruptThread(void);
static void handle_interrupt(uint32_t irqStatus);

static void rf_if_lock(void)
{
    platform_enter_critical();
}

static void rf_if_unlock(void)
{
    platform_exit_critical();
}

static void rf_set_power_level( uint8_t pwrStep)
{
    /* Do not exceed the Tx power limit for the current channel */
    if( pwrStep > gPhyChannelTxPowerLimits[ZLL->CHANNEL_NUM0 - 11] )
    {
        pwrStep = gPhyChannelTxPowerLimits[ZLL->CHANNEL_NUM0 - 11];
    }
    if( pwrStep > 2 )
    {
        pwrStep = (pwrStep << 1) - 2;
    }

    ZLL->PA_PWR = pwrStep;
}

static uint8_t rf_get_power_level(void)
{
    uint8_t pwrStep = (uint8_t)ZLL->PA_PWR;

    if( pwrStep > 2 )
    {
        pwrStep = (pwrStep + 2) >> 1;
    }
    
    return pwrStep;
}

#define gPhyIrqNo_d           (Radio_1_IRQn)
static void PHY_InstallIsr()
{
    NVIC_SetVector(gPhyIrqNo_d, (uint32_t)&PHY_InterruptHandler);
    NVIC_ClearPendingIRQ(gPhyIrqNo_d);
    NVIC_EnableIRQ(gPhyIrqNo_d);    
}

static void rf_channel_set(uint8_t channel)
{
    rf_phy_channel = channel;

    ZLL->CHANNEL_NUM0 = channel;

    if( rf_get_power_level() > gPhyChannelTxPowerLimits[channel - 11] )
    {
        rf_set_power_level(gPhyChannelTxPowerLimits[channel - 11]);
    }
}

static void rf_init(void)
{
    uint32_t phyReg;
    XCVR_Init( ZIGBEE_MODE, DR_500KBPS );
    
