istepura/kw41z-rf-driver/source/NanostackRfPhyKw41z.cpp
    return rf_radio_driver_id;
}

static int8_t rf_start_cca(uint8_t *data_ptr, uint16_t data_length, uint8_t tx_handle, data_protocol_e data_protocol )
{
    if( rf_get_state() == gRX_c )
    {
        uint8_t phyReg = (ZLL->SEQ_STATE & ZLL_SEQ_STATE_SEQ_STATE_MASK);
        /* Check for an Rx in progress. */
        if((phyReg <= 0x06) || (phyReg == 0x15) || (phyReg == 0x16))
        {
            if (device_driver.phy_tx_done_cb) {
                device_driver.phy_tx_done_cb(rf_radio_driver_id, mac_tx_handle, PHY_LINK_CCA_FAIL, 1, 1);
            }
            return -1;
        }
        rf_abort();
    }    
    uint8_t* pPB = (uint8_t*)ZLL->PKT_BUFFER_TX;
    pPB[0] = data_length + 2; /* including 2 bytes of FCS */
    memcpy(&pPB[1], data_ptr, data_length);

    ZLL->PHY_CTRL |= ZLL_PHY_CTRL_CCABFRTX_MASK;
    ZLL->PHY_CTRL &= ~ZLL_PHY_CTRL_CCATYPE_MASK;
    ZLL->PHY_CTRL |= ZLL_PHY_CTRL_CCATYPE(gCcaCCA_MODE1_c);

    mac_tx_handle = tx_handle;
    need_ack = (*data_ptr & 0x20) == 0x20;

    /* Set XCVR power state in run mode */
    rf_set_power_state(gPhyPwrRun_c);

    uint8_t xcvseq;    
    if(need_ack)
    {
        ZLL->PHY_CTRL |= ZLL_PHY_CTRL_RXACKRQD_MASK;
        xcvseq = gTR_c;
    
    }
    else
    {
        ZLL->PHY_CTRL &= ~ZLL_PHY_CTRL_RXACKRQD_MASK;
        xcvseq = gTX_c;        
    }    
    uint32_t irqSts;
    /* Ensure that no spurious interrupts are raised(do not change TMR1 and TMR4 IRQ status) */
    irqSts = ZLL->IRQSTS;
    irqSts &= ~(ZLL_IRQSTS_TMR1IRQ_MASK | ZLL_IRQSTS_TMR4IRQ_MASK);
    irqSts |= ZLL_IRQSTS_TMR3MSK_MASK;
    ZLL->IRQSTS = irqSts;

    ZLL->PHY_CTRL &= ~(ZLL_PHY_CTRL_XCVSEQ_MASK);
    /* Start the TX / TRX / CCA sequence */
    ZLL->PHY_CTRL |= xcvseq;
    /* Unmask SEQ interrupt */
    ZLL->PHY_CTRL &= ~ZLL_PHY_CTRL_SEQMSK_MASK;    

    return 0;
}

static void rf_set_short_adr(uint8_t * short_address)
{
    uint16_t value = ((uint16_t)short_address[0] << 8) | (uint16_t)short_address[1];
    //memcpy(&value, short_address, sizeof(value));
    ZLL->MACSHORTADDRS0 &= ~ZLL_MACSHORTADDRS0_MACSHORTADDRS0_MASK;
    ZLL->MACSHORTADDRS0 |= ZLL_MACSHORTADDRS0_MACSHORTADDRS0(value);    
}

static void rf_set_pan_id(uint8_t *pan_id)
{
    uint16_t value = ((uint16_t)pan_id[0] << 8) | (uint16_t)pan_id[1];
    ZLL->MACSHORTADDRS0 &= ~ZLL_MACSHORTADDRS0_MACPANID0_MASK;
    ZLL->MACSHORTADDRS0 |= ZLL_MACSHORTADDRS0_MACPANID0(value);
}

#define TO_UINT32(ptr, num) do {\
    num = (((uint32_t)(ptr)[0] << 24) |\
           ((uint32_t)(ptr)[1] << 16) |\
           ((uint32_t)(ptr)[2] << 8) |\
           ((uint32_t)(ptr)[3])); \
}while(0)

static void rf_set_address(uint8_t *address)
{
    uint32_t addrLo;
    uint32_t addrHi;    

    TO_UINT32(address, addrHi);
    TO_UINT32(address + 4, addrLo);

    ZLL->MACLONGADDRS0_LSB = addrLo;
    ZLL->MACLONGADDRS0_MSB = addrHi;    
} 

static int8_t rf_address_write(phy_address_type_e address_type, uint8_t *address_ptr)
{
    int8_t ret_val = 0;
    switch (address_type)
    {
        /*Set 48-bit address*/
        case PHY_MAC_48BIT:
            break;
            /*Set 64-bit address*/
        case PHY_MAC_64BIT:
            rf_set_address(address_ptr);
            break;
        /*Set 16-bit address*/
        case PHY_MAC_16BIT:
            rf_set_short_adr(address_ptr);
            break;
        /*Set PAN Id*/
        case PHY_MAC_PANID:
            rf_set_pan_id(address_ptr);
            break;
    }
    return ret_val;
}

static int8_t rf_extension(phy_extension_type_e extension_type, uint8_t *data_ptr)
{
    uint32_t type = (uint32_t)extension_type;
    switch (type)
    {
        /*Return frame pending status*/
        case PHY_EXTENSION_READ_LAST_ACK_PENDING_STATUS:
            *data_ptr = ((ZLL->IRQSTS & ZLL_IRQSTS_RX_FRM_PEND_MASK) >> ZLL_IRQSTS_RX_FRM_PEND_SHIFT);
            break;        
        /*Read energy on the channel*/
        case PHY_EXTENSION_READ_CHANNEL_ENERGY:
            *data_ptr = 100;
            break;            
    }    
    return 0;
}

#define mPhyDSM_GuardTime_d         (5) /* DSM_TIME ticks (32.768KHz) */
static uint32_t mPhyDSMDuration = 0xFFFFF0;
static void rf_set_power_state(phyPwrMode_t newState)
{
    if( newState == mPhyPwrState )
    {
        return;
    }
    else
    {
        switch(newState)
        {
            case gPhyPwrRun_c:
                /* Set XCVR in run mode if not allready */
                if(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK)
                {
                    RSIM->ZIG_WAKE = (RSIM->DSM_TIMER + mPhyDSM_GuardTime_d);
                    while(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK);
                }
                break;

            case gPhyPwrDSM_c:
                /* Set XCVR in low power mode if not allready */
                if(!(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK))
                {
                    uint32_t minTime = (RSIM->DSM_OSC_OFFSET > mPhyDSM_GuardTime_d) ? RSIM->DSM_OSC_OFFSET : mPhyDSM_GuardTime_d;

                    RSIM->ZIG_SLEEP = RSIM->DSM_TIMER + minTime;
                    RSIM->ZIG_WAKE = RSIM->DSM_TIMER + mPhyDSMDuration;
                    RSIM->DSM_CONTROL |= RSIM_DSM_CONTROL_ZIG_SYSCLK_REQUEST_EN_MASK |
                        RSIM_DSM_CONTROL_DSM_TIMER_EN_MASK | 
                        RSIM_DSM_CONTROL_ZIG_SYSCLK_INTERRUPT_EN_MASK;
                }
                break;
        }

        mPhyPwrState = newState;
    }
}

static void rf_off(void)
{
    rf_abort();
    rf_set_power_state(gPhyPwrDSM_c);
}

static void rf_shutdown(void)
{
    rf_off();
}

static int8_t rf_interface_state_control(phy_interface_state_e new_state, uint8_t rf_channel)
{
    int8_t ret_val = 0;
    switch (new_state)
    {
        /*Reset PHY driver and set to idle*/
        case PHY_INTERFACE_RESET:
            break;
        /*Disable PHY Interface driver*/
        case PHY_INTERFACE_DOWN:
            rf_shutdown();
            break;
        /*Enable PHY Interface driver*/
        case PHY_INTERFACE_UP:
            rf_channel_set(rf_channel);
            rf_receive();
            break;
        /*Enable wireless interface ED scan mode*/
        case PHY_INTERFACE_RX_ENERGY_STATE:
            rf_abort();
            rf_channel_set(rf_channel);
            break;
        case PHY_INTERFACE_SNIFFER_STATE:             /**< Enable Sniffer state */
            rf_promiscuous(1);
            rf_channel_set(rf_channel);
            rf_receive();
            break;
    }
    return ret_val;
}

